# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a = 10
b = 3.15
c = 'Hello World'
d = True
e = [a, b, c, d]

print(f'Variable {a} has data type: {type(a)}')
print(f'Variable {b} has data type: {type(b)}')
print(f'Variable {c} has data type: {type(c)}')
print(f'Variable {d} has data type: {type(d)}')
print(f'Variable {e} has data type: {type(e)}')